{"class_name": "Model", "keras_version": "2.1.2", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [null, 8], "name": "input_2", "dtype": "float32", "sparse": false}}, {"class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_7", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 8], "activity_regularizer": null, "dtype": "float32", "trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_7", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "units": 8, "kernel_constraint": null}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 8], "name": "input_1", "dtype": "float32", "sparse": false}}, {"class_name": "Dense", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "name": "dense_8", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "units": 4, "activation": "relu", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_8", "kernel_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_6", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 8], "activity_regularizer": null, "dtype": "float32", "trainable": true, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null, "name": "dense_6", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "units": 1, "kernel_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["dense_8", 0, 0, {}]]], "name": "dense_9", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "units": 1, "activation": "sigmoid", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_9", "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_9", 0, 0, {}]]], "name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_10", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "units": 1, "activation": "sigmoid", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_10", "kernel_constraint": null}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_10", 0, 0]]}, "backend": "tensorflow"}